Revit 2024 API
BuiltInFailures.GeometryFailures.CurveProjectTooShort Property
 The projection of the line in this view is too short to create a new Line
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveProjectTooShort { get; }
Visual Basic
Public Shared ReadOnly Property CurveProjectTooShort As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveProjectTooShort {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace